// Фомичев Андрей Михайлович, II Вариант
// ЛР12

/*
Выполнить задания лабораторной работы 4, 
оформив каждый пункт задания в виде шаблона 
функции. Все необходимсые данные для функций 
должны передаваться им в качестве параметров. 
Использование глобальные переменных в йункциях 
не допускается. Привести примеры программ 
использующих эти шаблоны для типов 
int, float и double.
*/

// P.S. На aнглийской винде лаба не компилится
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                  */
/*               Пояснение к работе 😊             */
/*                                                  */
/* Лабораторные работы 1,2,3 сделал с               */
/* использованием template, в четвертой             */
/* работе вместо template удобнее было              */
/* использовать lambda функции с                    */
/* псевдодинамическими типами аргументов.           */
/*                                                  */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
