// Фомичев Андрей Михайлович, II Вариант
// ЛР8

/*
Выполнить задания  из лабораторных работ 4-7, 
используя динамическое выделение памяти.
*/

// P.S. На aнглийской винде лаба не компилится
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                           */
/*                    Пояснение к работе 😊                 */
/*                                                           */
/* 4-ая Работа: использовал неявные итерации через           */
/*    указатели                                              */
/*                                                           */
/* 5-ая Работа: использовал разыминование указателей,        */
/* работал с указателями на начало и на конец                */
/* динамического массива в контексте класса vector           */
/*                                                           */
/* 6-ая Работа: использовал массив указателей.               */
/*                                                           */
/* 7-ая Работа: использовал динамические выделение           */
/* паматя для структуры STUDENT посредством оператора new    */
/*                                                           */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;