// Фомичев Андрей Михайлович, II Вариант
// ЛР13

/*
Выполнить задания лабораторной работы 10, разместив описание структуры в заголовочном файле, а определения функций и главную функцию программы - в двух отдельных файлах.
*/

// P.S. На aнглийской винде лаба не компилится
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                  */
/*               Пояснение к работе 😊             */
/*                                                  */
/* Разместел структуру scan_info в файле            */
/* scaner.h, там же создал "виртуальные" функциии,  */ 
/* их тело, а так же конструктор scan_info был      */
/* реализовано в файле scaner.cpp соответственно.   */
/*                                                  */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
