// Фомичев Андрей Михайлович, II Вариант
// ЛР18

/*
Задание 1:
Замерить время обработки Лабораторной работы 
№ 4 c помощью библиотеки <chrono>
Задание 2:
Выполнить задания лабораторной работы 7,11,14,16 с использованием подходящих контейнерных классов и алгоритмов библиотек.
*/

// P.S. На aнглийской винде лаба не компилится
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                        */
/*               Пояснение к работе 😊                   */
/*                                                        */
/* 4-ая Работа: использовал модуль chrono                 */
/* для замеров времени работы алгоритма                   */
/*                                                        */
/* 7-ая Работа: использовал класс STL::vector             */
/* для работы с массивами.                                */
/* 14-ая Работа: STL::set в качестве бинарного дерева,    */
/* для хранения сортированных книг.                       */
/* 16-ая использовал класс STL::vector для                */
/* работы с массивами.                                    */
/*                                                        */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
