// Фомичев Андрей Михайлович, II Вариант
// ЛР9

/*
Выполнить задания из лабораторных работ 4 и 5, 
оформив каждый пункт задания в виде функции. 
Все необходимые данные для функций должны 
передаваться им в качестве параметров. 
Использование глобальных переменных в 
функциях не допускается.
*/

// P.S. На aнглийской винде лаба не компилится 
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                  */
/*               Пояснение к работе 😊             */
/*                                                  */
/* Разбил части программы на тематичесие функции,   */
/* убрал дублирование, прокомментировал каждую      */
/* функцию отдельно.                                */
/*                                                  */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;