// Добавить valarray срезы и генератор случайных чисел.
// Фомичев Андрей Михайлович, II Вариант
// ЛР1

/*
Напишите программу для расчета по двум формулам.
Предварительно подготовьте текстовый пример с помощью 
калькулятора.Список математических функций приведен в
приложении 5(заголовочный файл <сmath>).Отсутствующие 
функции выразить через имеющиеся.
*/

// P.S. На aнглийской винде лаба не компилится 
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                        */
/*               Пояснение к работе 😊                   */
/*                                                        */
/* Добавил в ЛР 4 генератор случайных чисел               */
/*                                                        */
/* Из-за особенностей написанной программы                */
/* параметров, valarray добавить будет сложно,            */
/* с тем условием что он принесчет хоть какую-то          */
/* пользу написанному там коду                            */
/*                                                        */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
