
// Фомичев Андрей Михайлович, II Вариант
// ЛР18

/*
Выполнить задание лабораторной работы 
10 с использованием файловых потоков 
и методов обработки ошибок.
*/

// P.S. На aнглийской винде лаба не компилится
// из-за цыганского названия файла.cpp

int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                        */
/*               Пояснение к работе 😊                   */
/*                                                        */
/* 10-ая Работа: Выполнил работу посредством              */
/* использования файловых потоков <fstream>,              */
/* помимо этого применил конструкцию try+catch,           */
/* использовал ее в качестве отлова ошибок на             */
/* этапе открытия потоков на чтение и запись.             */
/*                                                        */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
