
// Фомичев Андрей Михайлович, II Вариант
// ЛР19

/*
Выполнить лабораторную работу 
11 с использованием класса 
string и регулярных выражений.
*/

// P.S. На aнглийской винде лаба не компилится
// из-за цыганского названия файла.cpp


int main(int argc, char const *argv[]){return 0;}

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
/*                                                        */
/*               Пояснение к работе 😊                   */
/*                                                        */
/* 11-ая Работа: Выполнил работу посредством              */
/* использование класса string вместо массива             */
/* char[], помимо этого применил регулярные               */
/* выражения <regex>, использовал функцию                 */
/* regex_search и регулярный шаблом.                      */
/*                                                        */
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
